In [9]:
import pandas as pd

In [10]:
# Series is one dimensional array (indice with names)
series = pd.Series([1, 2, 3])

In [11]:
series

0    1
1    2
2    3
dtype: int64

In [12]:
# Indices can be named
names = ["a", "b", "c"]
values = [34, 32, 678]
series2 = pd.Series(data=values, index=names, name = "my_series")

In [13]:
series2

a     34
b     32
c    678
Name: my_series, dtype: int64

In [16]:
# Dictionary is key value pairs
dict = {"a" : 4, "b" : "98", "hello" : 45}
series3 = pd.Series(dict)

In [17]:
series3

a         4
b        98
hello    45
dtype: object

In [18]:
# Dictionary : get value by index
series3[1]

'98'

In [19]:
# Dictionary : get value by key
series3["b"]

'98'

In [20]:
# Dictionary : get values in index range
series3[0:2]

a     4
b    98
dtype: object

## Dataframe

In [21]:
data = {'color' : ['blue', 'green', 'yellow', 'red', 'white'],
        'object' : ['ball', 'pen', 'pencil', 'paper', 'mug'],
        'price' : [1.2, 1.0, 0.6, 0.9, 1.7]}

In [22]:
# Dataframe is nested data structure
dataframe = pd.DataFrame(data, index=["once", "two", "three", "four", "five"])

In [23]:
dataframe

        color  object  price
once     blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [24]:
# Return the column : color
dataframe["color"]

once       blue
two       green
three    yellow
four        red
five      white
Name: color, dtype: object

In [26]:
# Get object by row
dataframe.loc["three"]

color     yellow
object    pencil
price        0.6
Name: three, dtype: object

In [28]:
# Get row by index
dataframe.iloc[2]

color     yellow
object    pencil
price        0.6
Name: three, dtype: object

In [47]:
# Get subset of dataframe by row and column
dataframe.loc[["two", "three"], ["object", "price"]]

       object  price
two       pen    1.0
three  pencil    0.6

In [48]:
# Create new column
dataframe["new"] = dataframe["price"] **2

In [49]:
dataframe

        color  object  price   new
once     blue    ball    1.2  1.44
two     green     pen    1.0  1.00
three  yellow  pencil    0.6  0.36
four      red   paper    0.9  0.81
five    white     mug    1.7  2.89

In [50]:
# Drop a column
# To save the drop or change; give parameter inplace=True
dataframe.drop("new", axis=1, inplace=True)

In [51]:
dataframe

        color  object  price
once     blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [52]:
# Conditional Selection
# Get datas with price less than 1
dataframe[dataframe["price"] < 1]

        color  object  price
three  yellow  pencil    0.6
four      red   paper    0.9

In [53]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [54]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [55]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [56]:
# Concatenate multiple dataframes into one
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [57]:
my_data = pd.concat([df1, df2, df3])

In [58]:
my_data.to_csv("my_csv.csv")